
# tap repositories and their packages

tap 'homebrew/core'
brew 'adns'
brew 'amazon-ecs-cli'
brew 'aom'
brew 'autoconf'
brew 'autojump'
brew 'awscli'
brew 'bazaar'
brew 'bdw-gc'
brew 'berkeley-db'
brew 'boost'
brew 'brotli'
brew 'c-ares'
brew 'cairo'
brew 'ccache'
brew 'cheat'
brew 'circleci'
brew 'cmake'
brew 'dav1d'
brew 'double-conversion'
brew 'ffmpeg'
brew 'firebase-cli'
brew 'flac'
brew 'fmt'
brew 'folly'
brew 'fontconfig'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fzf'
brew 'gdbm'
brew 'gettext'
brew 'gflags'
brew 'gh'
brew 'giflib'
brew 'glib'
brew 'glog'
brew 'gmp'
brew 'gnupg'
brew 'go'
brew 'gobject-introspection'
brew 'graphite2'
brew 'guile'
brew 'harfbuzz'
brew 'helm'
brew 'hopenpgp-tools'
brew 'htop'
brew 'httpie'
brew 'icu4c'
brew 'jemalloc'
brew 'jpeg'
brew 'jq'
brew 'json-c'
brew 'k9s'
brew 'krb5'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'lame'
brew 'leptonica'
brew 'libass'
brew 'libassuan'
brew 'libbluray'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libidn2'
brew 'libksba'
brew 'libogg'
brew 'libpng'
brew 'libpthread-stubs'
brew 'libsamplerate'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvidstab'
brew 'libvorbis'
brew 'libvpx'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'libyaml'
brew 'libyubikey'
brew 'little-cms2'
brew 'lua'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mackup'
brew 'mas'
brew 'mpdecimal'
brew 'ncurses'
brew 'nettle'
brew 'nghttp2'
brew 'node'
brew 'npth'
brew 'nvm'
brew 'oniguruma'
brew 'opencore-amr'
brew 'openjdk'
brew 'openjpeg'
brew 'openssl@1.1'
brew 'opus'
brew 'p11-kit'
brew 'pcre'
brew 'perl'
brew 'pinentry'
brew 'pinentry-mac'
brew 'pipenv'
brew 'pixman'
brew 'pkg-config'
brew 'postgresql'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python@3.8'
brew 'python@3.9'
brew 'rav1e'
brew 'readline'
brew 'rtmpdump'
brew 'rubberband'
brew 'ruby'
brew 'sdl2'
brew 'snappy'
brew 'solidity'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'tcl-tk'
brew 'terraform'
brew 'tesseract'
brew 'the_silver_searcher'
brew 'theora'
brew 'tmux'
brew 'tmuxinator'
brew 'trash'
brew 'tree'
brew 'unbound'
brew 'utf8proc'
brew 'vim'
brew 'watchman'
brew 'webp'
brew 'wget'
brew 'x264'
brew 'x265'
brew 'xorgproto'
brew 'xvid'
brew 'xz'
brew 'yarn'
brew 'ykman'
brew 'ykpers'
brew 'youtube-dl'
brew 'yq'
brew 'z3'
brew 'zeromq'
brew 'zimg'
brew 'zstd'

tap 'homebrew/bundle'

tap 'homebrew/cask-fonts'
cask 'font-hack-nerd-font'

tap 'homebrew/cask-versions'
cask 'visual-studio-code-insiders'

tap 'homebrew/services'

tap 'homebrew/cask'
cask 'brave-browser'
cask 'calibre'
cask 'discord'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'ipfs'
cask 'kitty'
cask 'ngrok'
cask 'protonvpn'
cask 'signal'
cask 'spotify'
cask 'transmission'
cask 'vlc'
cask 'zoom'

tap 'clintmod/formulas'
brew 'macprefs'

tap 'ethereum/ethereum'

tap 'github/gh'

tap 'heroku/brew'
brew 'heroku'
brew 'heroku-node'

tap 'koekeishiya/formulae'
brew 'skhd'
brew 'yabai', args: ['HEAD']

tap 'rcmdnk/file'
brew 'brew-file'

tap 'sambadevi/powerlevel9k'

tap 'somdoron/formulae'

# Other Homebrew packages
cask 'ngrok'
brew 'python'

# App Store applications
mas '1Password 7 (7.9.2)', id: 1333542190
mas 'Adobe Lightroom (5.0)', id: 1451544217
mas 'everyday (1.2.4)', id: 1394150432
mas 'Fantastical (3.5.1)', id: 975937182
mas 'GarageBand (10.4.4)', id: 682658836
mas 'iMovie (10.3.1)', id: 408981434
mas 'Keynote (11.2)', id: 409183694
mas 'Notability (4.4.4)', id: 736189492
mas 'Numbers (11.2)', id: 409203825
mas 'Pages (11.2)', id: 409201541
mas 'Skitch (2.9)', id: 425955336
mas 'Slack (4.22.1)', id: 803453959
mas 'Telegram (8.2)', id: 747648890
mas 'Xcode (13.1)', id: 497799835
