
# tap repositories and their packages

tap 'homebrew/core'
brew 'adns'
brew 'amazon-ecs-cli'
brew 'aom'
brew 'autoconf'
brew 'autojump'
brew 'awscli'
brew 'bazaar'
brew 'boost'
brew 'cairo'
brew 'ccache'
brew 'cheat'
brew 'circleci'
brew 'cmake'
brew 'dav1d'
brew 'ffmpeg'
brew 'firebase-cli'
brew 'flac'
brew 'fontconfig'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fzf'
brew 'gdbm'
brew 'gettext'
brew 'gh'
brew 'giflib'
brew 'glib'
brew 'gmp'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'graphite2'
brew 'harfbuzz'
brew 'helm'
brew 'hopenpgp-tools'
brew 'htop'
brew 'httpie'
brew 'icu4c'
brew 'jpeg'
brew 'jq'
brew 'json-c'
brew 'k9s'
brew 'krb5'
brew 'lame'
brew 'leptonica'
brew 'libass'
brew 'libassuan'
brew 'libbluray'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libidn2'
brew 'libksba'
brew 'libogg'
brew 'libpng'
brew 'libsamplerate'
brew 'libsndfile'
brew 'libsoxr'
brew 'libtasn1'
brew 'libtiff'
brew 'libunistring'
brew 'libusb'
brew 'libvidstab'
brew 'libvorbis'
brew 'libvpx'
brew 'libyaml'
brew 'libyubikey'
brew 'little-cms2'
brew 'lua'
brew 'lzo'
brew 'mackup'
brew 'mas'
brew 'ncurses'
brew 'nettle'
brew 'node'
brew 'npth'
brew 'nvm'
brew 'oniguruma'
brew 'opencore-amr'
brew 'openjpeg'
brew 'openssl@1.1'
brew 'opus'
brew 'p11-kit'
brew 'pcre'
brew 'perl'
brew 'pinentry'
brew 'pinentry-mac'
brew 'pipenv'
brew 'pixman'
brew 'pkg-config'
brew 'postgresql'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python@3.8'
brew 'rav1e'
brew 'readline'
brew 'rtmpdump'
brew 'rubberband'
brew 'ruby'
brew 'sdl2'
brew 'snappy'
brew 'solidity'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'terraform'
brew 'tesseract'
brew 'the_silver_searcher'
brew 'theora'
brew 'trash'
brew 'tree'
brew 'unbound'
brew 'vim'
brew 'watchman'
brew 'webp'
brew 'wget'
brew 'wrk'
brew 'x264'
brew 'x265'
brew 'xvid'
brew 'xz'
brew 'yarn'
brew 'ykman'
brew 'ykpers'
brew 'youtube-dl'
brew 'z3'

tap 'homebrew/bundle'

tap 'homebrew/cask-fonts'
cask 'font-hack-nerd-font'

tap 'homebrew/cask-versions'
cask 'visual-studio-code-insiders'

tap 'homebrew/services'

tap 'homebrew/cask'
cask 'google-chrome'
cask 'ipfs'
cask 'kitty'
cask 'metabase'
cask 'spotify'
cask 'vlc'
cask 'zoom'

tap 'clintmod/formulas'
brew 'macprefs'

tap 'ethereum/ethereum'

tap 'github/gh'

tap 'heroku/brew'
brew 'heroku'
brew 'heroku-node'

tap 'koekeishiya/formulae'
brew 'skhd'
brew 'yabai'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'somdoron/formulae'
brew 'spacebar'

# Other Homebrew packages
brew 'ngrok'
brew 'python'

# App Store applications
mas "1Password 7", id: 1333542190
mas "Adobe Lightroom", id: 1451544217
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "Xcode", id: 497799835
