tap "clintmod/formulas"
tap "cmacrae/formulae"
tap "ethereum/ethereum"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "planetscale/tap"
tap "rcmdnk/file"
brew "adns"
brew "amazon-ecs-cli"
brew "aom"
brew "autoconf"
brew "autojump"
brew "automake"
brew "awscli"
brew "bazaar"
brew "bison"
brew "boost"
brew "cairo"
brew "ccache"
brew "cheat"
brew "chruby"
brew "circleci"
brew "clintmod/formulas/macprefs"
brew "cmacrae/formulae/spacebar"
brew "cmake"
brew "dav1d"
brew "fb303"
brew "fbthrift"
brew "ffmpeg"
brew "firebase-cli"
brew "fizz"
brew "flac"
brew "folly"
brew "fontconfig"
brew "freetype"
brew "frei0r"
brew "fribidi"
brew "fzf"
brew "gdbm"
brew "gettext"
brew "gh"
brew "giflib"
brew "git"
brew "glib"
brew "gmp"
brew "gnupg"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "graphite2"
brew "guile"
brew "harfbuzz"
brew "helm"
brew "heroku/brew/heroku"
brew "heroku/brew/heroku-node"
brew "hopenpgp-tools"
brew "htop"
brew "httpie"
brew "jpeg", link: true
brew "jq"
brew "json-c"
brew "k9s"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "kubectx"
brew "lame"
brew "leptonica"
brew "libass"
brew "libassuan"
brew "libbluray"
brew "libevent"
brew "libffi"
brew "libgcrypt"
brew "libgpg-error"
brew "libidn2"
brew "libksba"
brew "libogg"
brew "libpng"
brew "libsamplerate"
brew "libsndfile"
brew "libsoxr"
brew "libtasn1"
brew "libtiff"
brew "libunistring"
brew "libusb"
brew "libvidstab"
brew "libvorbis"
brew "libvpx"
brew "libyaml"
brew "libyubikey"
brew "little-cms2"
brew "lua"
brew "lzo"
brew "mackup"
brew "mas"
brew "mysql-client"
brew "nettle"
brew "node"
brew "nodenv"
brew "npth"
brew "nvm"
brew "oniguruma"
brew "opencore-amr"
brew "openjpeg"
brew "openssl@1.1"
brew "opus"
brew "p11-kit"
brew "pcre"
brew "pinentry"
brew "pinentry-mac"
brew "pipenv"
brew "pixman"
brew "pkg-config"
brew "planetscale/tap/pscale"
brew "postgresql@14"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "python@3.8"
brew "python@3.9"
brew "rav1e"
brew "rcmdnk/file/brew-file"
brew "readline"
brew "rename"
brew "rtmpdump"
brew "rubberband"
brew "ruby-install"
brew "sdl2"
brew "snappy"
brew "solidity"
brew "speex"
brew "srt"
brew "subversion"
brew "terraform"
brew "tesseract"
brew "the_silver_searcher"
brew "theora"
brew "tmux"
brew "trash"
brew "tree"
brew "unbound"
brew "vim"
brew "wangle"
brew "watchman"
brew "webp"
brew "wget"
brew "wrk"
brew "x264"
brew "x265"
brew "xvid"
brew "xz"
brew "yarn"
brew "ykman"
brew "ykpers"
brew "youtube-dl"
brew "z3"
cask "font-hack-nerd-font"
cask "font-roboto"
cask "font-roboto-mono"
cask "google-chrome"
cask "google-cloud-sdk"
cask "hammerspoon"
cask "ipfs"
cask "kindle"
cask "kitty"
cask "metabase"
cask "ngrok"
cask "signal"
cask "spotify"
cask "visual-studio-code-insiders"
cask "vlc"
cask "zoom"
mas "1Password 7", id: 1333542190
mas "Adobe Lightroom", id: 1451544217
mas "Default Browser", id: 1055264211
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "iMovie", id: 408981434
mas "scaler", id: 1612708557
